socialNetwork/results/scaling-on-sweep-bench1.5-may20/benchmark1.5b-sweep-05-20-26_014900/st5-AttUpd/3200.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 97.938ms, rate sampling interval: 414ms
  Thread calibration: mean lat.: 90.850ms, rate sampling interval: 377ms
  Thread calibration: mean lat.: 97.805ms, rate sampling interval: 369ms
  Thread calibration: mean lat.: 89.892ms, rate sampling interval: 357ms
  Thread calibration: mean lat.: 106.844ms, rate sampling interval: 459ms
  Thread calibration: mean lat.: 103.100ms, rate sampling interval: 444ms
  Thread calibration: mean lat.: 93.096ms, rate sampling interval: 388ms
  Thread calibration: mean lat.: 94.902ms, rate sampling interval: 363ms
  Thread calibration: mean lat.: 95.378ms, rate sampling interval: 397ms
  Thread calibration: mean lat.: 93.247ms, rate sampling interval: 365ms
  Thread calibration: mean lat.: 93.301ms, rate sampling interval: 374ms
  Thread calibration: mean lat.: 102.213ms, rate sampling interval: 392ms
  Thread calibration: mean lat.: 88.528ms, rate sampling interval: 361ms
  Thread calibration: mean lat.: 88.228ms, rate sampling interval: 370ms
  Thread calibration: mean lat.: 89.093ms, rate sampling interval: 367ms
  Thread calibration: mean lat.: 102.156ms, rate sampling interval: 417ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   278.02ms  512.43ms   3.36s    95.77%
    Req/Sec   200.23     14.05   230.00     72.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  152.83ms
 75.000%  305.15ms
 90.000%  535.04ms
 99.000%    3.36s 
 99.900%    5.30s 
 99.990%    5.66s 
 99.999%    5.77s 
100.000%    5.82s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      15.271     0.000000            1         1.00
      40.031     0.100000        35324         1.11
      61.887     0.200000        70556         1.25
      86.783     0.300000       105863         1.43
     116.607     0.400000       141110         1.67
     152.831     0.500000       176415         2.00
     174.463     0.550000       193997         2.22
     199.295     0.600000       211709         2.50
     227.967     0.650000       229296         2.86
     262.655     0.700000       246971         3.33
     305.151     0.750000       264591         4.00
     331.007     0.775000       273413         4.44
     359.935     0.800000       282199         5.00
     392.703     0.825000       291040         5.71
     431.103     0.850000       299801         6.67
     477.183     0.875000       308623         8.00
     504.063     0.887500       313031         8.89
     535.039     0.900000       317451        10.00
     571.391     0.912500       321859        11.43
     613.887     0.925000       326275        13.33
     665.599     0.937500       330667        16.00
     696.831     0.943750       332889        17.78
     734.207     0.950000       335098        20.00
     778.239     0.956250       337280        22.86
     838.655     0.962500       339484        26.67
     917.503     0.968750       341683        32.00
     974.847     0.971875       342786        35.56
    1050.623     0.975000       343886        40.00
    1169.407     0.978125       344990        45.71
    1344.511     0.981250       346094        53.33
    1868.799     0.984375       347194        64.00
    2291.711     0.985938       347748        71.11
    2719.743     0.987500       348298        80.00
    3094.527     0.989062       348846        91.43
    3520.511     0.990625       349397       106.67
    3846.143     0.992188       349950       128.00
    4040.703     0.992969       350224       142.22
    4268.031     0.993750       350500       160.00
    4481.023     0.994531       350778       182.86
    4628.479     0.995313       351053       213.33
    4751.359     0.996094       351341       256.00
    4800.511     0.996484       351468       284.44
    4866.047     0.996875       351614       320.00
    4923.391     0.997266       351744       365.71
    5017.599     0.997656       351879       426.67
    5087.231     0.998047       352016       512.00
    5115.903     0.998242       352088       568.89
    5144.575     0.998437       352152       640.00
    5193.727     0.998633       352224       731.43
    5255.167     0.998828       352293       853.33
    5308.415     0.999023       352359      1024.00
    5341.183     0.999121       352399      1137.78
    5378.047     0.999219       352428      1280.00
    5431.295     0.999316       352464      1462.86
    5480.447     0.999414       352498      1706.67
    5513.215     0.999512       352532      2048.00
    5525.503     0.999561       352551      2275.56
    5537.791     0.999609       352566      2560.00
    5558.271     0.999658       352591      2925.71
    5570.559     0.999707       352602      3413.33
    5591.039     0.999756       352617      4096.00
    5603.327     0.999780       352629      4551.11
    5619.711     0.999805       352637      5120.00
    5627.903     0.999829       352644      5851.43
    5636.095     0.999854       352653      6826.67
    5648.383     0.999878       352661      8192.00
    5652.479     0.999890       352665      9102.22
    5668.863     0.999902       352671     10240.00
    5672.959     0.999915       352673     11702.86
    5685.247     0.999927       352678     13653.33
    5693.439     0.999939       352682     16384.00
    5701.631     0.999945       352687     18204.44
    5701.631     0.999951       352687     20480.00
    5705.727     0.999957       352689     23405.71
    5722.111     0.999963       352694     27306.67
    5722.111     0.999969       352694     32768.00
    5722.111     0.999973       352694     36408.89
    5730.303     0.999976       352695     40960.00
    5738.495     0.999979       352696     46811.43
    5746.687     0.999982       352698     54613.33
    5746.687     0.999985       352698     65536.00
    5767.167     0.999986       352700     72817.78
    5767.167     0.999988       352700     81920.00
    5767.167     0.999989       352700     93622.86
    5767.167     0.999991       352700    109226.67
    5795.839     0.999992       352701    131072.00
    5795.839     0.999993       352701    145635.56
    5795.839     0.999994       352701    163840.00
    5799.935     0.999995       352702    187245.71
    5799.935     0.999995       352702    218453.33
    5799.935     0.999996       352702    262144.00
    5799.935     0.999997       352702    291271.11
    5799.935     0.999997       352702    327680.00
    5816.319     0.999997       352703    374491.43
    5816.319     1.000000       352703          inf
#[Mean    =      278.019, StdDeviation   =      512.426]
#[Max     =     5812.224, Total count    =       352703]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  384213 requests in 2.00m, 5.24GB read
  Non-2xx or 3xx responses: 1
Requests/sec:   3202.57  
Transfer/sec:     44.72MB